package main

import (
	"backend/internal/db"
	"fmt"
	"log"
	"strings"
)

var addresses = []string{
	"7394ДС_Нижегородская32",
	"8317ДС_Волгоградский73",
	"7290ДС_Кор_Тихонравова11",
	"7192ДС_Ивнт_Железнодорожная11",
	"6836ДС_Щел_Фряновское1",
	"5834ДС_Мира64",
	"8578ДС_Малыгина9",
	"6737ДС_Мыт_Волковское23",
	"5955ДС_Мыт_Станционная7",
	"8079ДС_Мыт_Фабричная17",
	"5469ДС_Дубнинская83",
	"7626ДС_Гончарова17",
	"7901ДС_Смольная34",
	"4785ДС_Солнечногорская4",
	"6859ДС_Соколово-Мещерская40",
	"4755ДС_Пятницкое29",
	"4801ДС_Походный5",
	"5814ДС_Алтуфьевское22",
	"8781ДС_Римского-Корсакова 11",
	"7164ДС_Чермянская5",
	"7482ДС_АкадемикаКоролева13",
	"4969ДС_Дол_Транспортный11",
	"5411ДС_СПос_Стахановская1",
	"Кулакова (офис Строгино+ Магазин Кафе)",
	"5339ДС_Ист_Урицкого86",
	"5517ДС_Рам_Михалевича71",
	"8202ДС_Бал_Южная13",
	"4781ДС_Бал_Промышленная49",
	"8253ДС_Барболина2",
	"8443ДС_Зеленый3",
	"8319ДС_Хлобыстова3",
	"7498ДС_Фабрициуса18",
	"8175ДС_Снежная27",
	"5689ДС_Воротынская2",
	"7787ДС_Пут_ МКАД71км16",
	"5005ДС_Кутузовский88",
	"5531ДС_ГенералаБелова26",
	"4835ДС_Лефортовский Вал 26",
	"5591ДС_Тре_Трехгорная12",
	"5848ДС_Ленинский54",
	"6097ДС_Академика Глушко 15",
	"5980ДС_1-яМагистральная18",
	"4811ДС_Миклухо-Маклая40",
	"6028ДС_Покровский бульвар 3",
	"5508ДС_Ставропольская 41",
	"6098ДС_Несвижский переулок 2",
	"6783ДС Береговой проезд, 4/6с1",
	"6694ДС_Наметкина 3",
	"6965ДС_7яКожуховская9",
	"7266ДС_Варшавское95",
	"7406ДС_Венёвская 4",
	"5831ДС_Немчиновка_1-яЗапрудная 26",
	"7316ДС_Бирюлевская 47",
	"7461ДС_Новочеркасский10",
	"8092ДС_Садовая-Триумфальная22",
	"8110ДС_Нагатинская 16",
	"8483ДС_Автозаводская 24",
	"8417ОС_МаршалаПрошлякова5",
	"8548ДС_Миклухо-Маклая 18",
	"8993ДС_Тишинская1",
	"8999ДС_ Большая Тульская 2",
	"5656ДС_Тро_Фабричная1",
	"4795ДС_Шолохова19",
	"4815ДС_Один_Транспортная2",
	"5791ДС_Новоясеневский8",
	"7087ДС_Ббр_239",
	"5818ДС_ОлимпийскаяДеревня4",
	"4799ДС_Речников17",
	"8065ДС_Берзарина21",
	"8136ДС_Кот_2-йПокровский11",
	"5467ДС_Зве_Пролетарская53",
	"8168ДС_Апр_Дубки1",
	"5366ДС_Жук_Королева5",
	"7149ДС_Сер_5-ЯБорисовская16",
	"8396ДС_Чех_Симферопольское1",
	"8072ДС_Под_Профсоюзная1",
	"8877ДС_Симферопольское14",
	"9038ДС_Сол_Почтовая27",
	"8347ДС_Тарычево_5",
	"8995ДС_Дом_Талалихина41",
	"8557ДС_6-яНововатутинская2",
	"4723ДС_Мос_Солнечная3",
	"8096ДС_Люб_Некрасовский4",
	"8289ДС_Дом_Набережная12",
	"8678ОС_Кор_Калининградская5Сервисы",
}

func main() {
	db.InitDB()

	for _, addr := range addresses {
		address := db.Address{
			Address: strings.TrimSpace(addr),
		}

		var existingAddress db.Address
		if err := db.DB.Where("address = ?", address.Address).First(&existingAddress).Error; err == nil {
			fmt.Printf("Адрес '%s' уже существует\n", address.Address)
			continue
		}

		if err := db.DB.Create(&address).Error; err != nil {
			log.Printf("Ошибка при добавлении адреса '%s': %v\n", address.Address, err)
		} else {
			fmt.Printf("Адрес '%s' успешно добавлен\n", address.Address)
		}
	}

	fmt.Println("Заполнение базы данных адресами завершено")
}
